Revit 2027 API
DefinitionBindingMapIterator.Reset Method
Bring the iterator back to the start of the map.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual void Reset()
Public Overridable Sub Reset
public:
virtual void Reset()
abstract Reset : unit -> unit
override Reset : unit -> unit
Implements
IEnumerator.Reset()
Remarks
The Reset method will return the iterator back to the start of the map in line with the definition of IEnumerator. Note that you must call MoveNext before the first item can be accessed via the Current property.
See Also
Reference
DefinitionBindingMapIterator Class
Autodesk.Revit.DB Namespace